# 1. Introduction to SQL

SQL, which stands for Structured Query Language, is a language for interacting with data stored in something called a relational database.

You can think of a relational database as a collection of tables. A table is just a set of rows and columns, like a spreadsheet, which represents exactly one type of entity. For example, a table might represent employees in a company or purchases made, but not both.

Each row, or record, of a table contains information about a single entity.

For this tutorial, we will use a movie database that contains information about different movies, actors and reviews and rolse for the movies. The database contains the following tables:

- films
- people
- reviews
- roles

Lets have a quick look at the different tables:

##### movies table

Every row in the movies table consists of the following entries:

- id
- title
- release_year
- country
- duration
- language
- certification
- gross and 
- budget


##### people table

The people table consists of four columns:

- id
- name
- birthdate and
- deathdate

##### reviews table

The reviews table has the following columns:

- id
- film_id
- num_users
- num_critic
- imdb_score
- num_votes
- facebook_likes

Here we can see that the review table has a column named *film_id*, which connects the reviews to the films.

##### roles  table

The roles tells us which role peoples (*person_id*) had in a particular movie (*movie_id*).
We find the following columns in the roles table:

- id
- film_id
- person_id
- role

**In order to connect to the database, we will use sqlite3, which is a self-contained, serverless database engine.** <br>
Lets start by importing sqlite3

In [36]:
import sqlite3

Next, we will set up a simple class, that can connect and query a database.
For better visualization, we use the Python pandas library.

In [95]:
import pandas as pd

class DB:  
    
    def __init__(self, db_path = "data/films.db"):
        
        """
        Class initializer
        
        Args
            dp_path (str): Path to database file
        Returns
            None
        """
        self.db_path = db_path
        self.conn = sqlite3.connect(db_path)
        self.conn.text_factory = str 
    
    def query(self, q, return_result = False):
        """
        queries the database
        
        Args
            q (str): query string
            return_result (bool): return query result if TRUE
        Returns
            query_result (tuple): tuples containig the query results
         
        """
        
        query_result = pd.read_sql_query(q, self.conn)
        
        if return_result: return query_result
         
        print(query_result)    
    
    def open_conn(self):
        """
        open db connection
        
        Args
            None
        Returns
            None         
        """
        
        self.conn = sqlite3.connect(self.db_path)
        
    def close_conn(self):
        """
        close db connection
        
        Args
            None
        Returns
            None         
        """
        
        self.conn.close()

In [96]:
db = DB(db_path = "data/films.db")

## Selecting columns

### Selecting single columns

While SQL can be used to create and modify databases, the focus of this tutorial will be querying databases. A query is a request for data from a database table (or combination of tables). 

In SQL, you can select data from a table using a **SELECT** statement. 

```sql
SELECT column
FROM table;
```

In [97]:
q = "SELECT name from people"

db.query(q)

                    name
0                50 Cent
1     A. Michael Baldwin
2          A. Raven Cruz
3           A.J. Buckley
4           A.J. DeLucia
...                  ...
8392         Zohra Segal
8393     Zooey Deschanel
8394       Zoran Lisinac
8395       Zubaida Sahar
8396       Zuhair Haddad

[8397 rows x 1 columns]

In [98]:
q = "SELECT title FROM films"
db.query(q)

                                                 title
0     Intolerance: Love's Struggle Throughout the Ages
1                       Over the Hill to the Poorhouse
2                                       The Big Parade
3                                           Metropolis
4                                        Pandora's Box
...                                                ...
4963                                       Unforgotten
4964                                             Wings
4965                                        Wolf Creek
4966                                 Wuthering Heights
4967                           Yu-Gi-Oh! Duel Monsters

[4968 rows x 1 columns]

In [99]:
q = "SELECT release_year FROM films"

db.query(q)

     release_year
0            1916
1            1920
2            1925
3            1927
4            1929
...           ...
4963         null
4964         null
4965         null
4966         null
4967         null

[4968 rows x 1 columns]

### Selecting multiple columns

Well done! Now you know how to select single columns.

In the real world, you will often want to select multiple columns. Luckily, SQL makes this really easy. <br>
To select multiple columns from a table, simply separate the column names with commas!

For example, this query selects two columns, name and birthdate, from the people table:

```sql
SELECT name, birthdate
FROM people;
```

Sometimes, you may want to select all columns from a table. Typing out every column name would be a pain, so there's a handy shortcut:

```sql
SELECT *
FROM people;
```

If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

```sql
SELECT *
FROM people
LIMIT 10;
```

In [100]:
#Select both title and year and return the first 10 entries
q = "SELECT title, release_year FROM films LIMIT 10"
db.query(q)

                                              title  release_year
0  Intolerance: Love's Struggle Throughout the Ages          1916
1                    Over the Hill to the Poorhouse          1920
2                                    The Big Parade          1925
3                                        Metropolis          1927
4                                     Pandora's Box          1929
5                               The Broadway Melody          1929
6                                     Hell's Angels          1930
7                                A Farewell to Arms          1932
8                                       42nd Street          1933
9                                She Done Him Wrong          1933

### Select distinct

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

This might be useful if, for example, you're interested in knowing which languages are represented in the films table:

```sql
SELECT DISTINCT language
FROM films;
```

Lets get all different countries contained in the films table...

In [101]:
#Select all unique countries from the films table
q = "SELECT DISTINCT country FROM films"
db.query(q)

     country
0        USA
1    Germany
2      Japan
3    Denmark
4         UK
..       ...
60     Kenya
61  Slovenia
62  Pakistan
63     Chile
64    Panama

[65 rows x 1 columns]

We can see that there are 65 different countries in the films table.

We can also take a look at the *roles* table, to get all different roles that a person can have in a movie.

In [102]:
#Select all unique roles from the roles table
q = "SELECT DISTINCT role FROM roles"
db.query(q)

       role
0  director
1     actor

A person in a movie is either been labeled as an actor or as the director of the movie.

### Learning to count
What if you want to count the number of persons in your people table? The **COUNT()** function lets you do this by returning the number of rows in one or more columns.

The syntax for the COUNT() function is:

```sql
SELECT COUNT(column)
FROM table;
```

Lets count the number of persons in the people table....

In [103]:
#Count the number of unique actors 
q = "SELECT COUNT(*) FROM people"
db.query(q)

   COUNT(*)
0      8397

The COUNT() function can also be applied on a single column

In [104]:
#Count the number of unique actors 
q = "SELECT COUNT(birthdate) FROM people"
db.query(q)


#Count the number of unique actors 
q = "SELECT COUNT(DISTINCT(birthdate)) FROM people"
db.query(q)

   COUNT(birthdate)
0              8397
   COUNT(DISTINCT(birthdate))
0                        5399

**Note** The COUNT() function used on a particular column returns the number of non-missing values.

## Filtering rows

This part of the tutorial will focus on filtering query results.

In SQL, the **WHERE** keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

- *=* equal
- <> not equal
- < less than
- *>* greater than
- <= less than or equal to
- *>=* greater than or equal to

```sql
SELECT column
FROM table
WHERE condition1 = condition2;
```

**Note** Notice that the WHERE clause always comes after the FROM statement!

For example, you can filter text records such as title. The following code returns all films with the title 'Metropolis':

In [105]:
q = "SELECT title, release_year FROM films \
    WHERE title = 'Metropolis'"
db.query(q)

        title  release_year
0  Metropolis          1927

Or get all movies that were released later than the year 2000.

In [106]:
q = "SELECT title FROM films \
    WHERE release_year > 2000"
db.query(q)

                             title
0                       15 Minutes
1          3000 Miles to Graceland
2                 A Beautiful Mind
3                  A Knight's Tale
4     A.I. Artificial Intelligence
...                            ...
3455                   Unforgotten
3456                         Wings
3457                    Wolf Creek
3458             Wuthering Heights
3459       Yu-Gi-Oh! Duel Monsters

[3460 rows x 1 columns]

### Filtering numeric values
As you learned in the previous exercise, the WHERE clause can also be used to filter numeric records, such as years or ages.

For example, the following query selects all details for films with a budget over ten thousand dollars:

In [107]:
q = "SELECT * FROM films \
    WHERE budget > 10000"
db.query(q)

        id                                             title release_year  \
0        1  Intolerance: Love's Struggle Throughout the Ages         1916
1        2                    Over the Hill to the Poorhouse         1920
2        3                                    The Big Parade         1925
3        4                                        Metropolis         1927
4        5                                     Pandora's Box         1929
...    ...                                               ...          ...
4951  4964                                       Unforgotten         null
4952  4965                                             Wings         null
4953  4966                                        Wolf Creek         null
4954  4967                                 Wuthering Heights         null
4955  4968                           Yu-Gi-Oh! Duel Monsters         null

        country duration  language certification    gross   budget
0           USA      123      null     Not Rated     null   385907
1           USA      110      null          null  3000000   100000
2           USA      151      null     Not Rated     null   245000
3       Germany      145    German     Not Rated    26435  6000000
4       Germany      110    German     Not Rated     9950     null
...         ...      ...       ...           ...      ...      ...
4951         UK       45   English          null     null     null
4952        USA       30   English          null     null     null
4953  Australia     null   English          null     null     null
4954         UK      142   English          null     null     null
4955      Japan       24  Japanese          null     null     null

[4956 rows x 9 columns]

### Filtering text

Remember, the WHERE clause can also be used to filter text results, such as names or countries.

For example, this query gets the titles of all films which were filmed in China:

In [108]:
q = "SELECT title \
    FROM films\
    WHERE country = 'China';"
db.query(q)

                                          title
0                              The Last Emperor
1                                          Hero
2                                          Hero
3                       House of Flying Daggers
4                                   The Promise
5                                   Crazy Stone
6                    Curse of the Golden Flower
7                              The Painted Veil
8                                     Red Cliff
9    Three Kingdoms: Resurrection of the Dragon
10             A Woman, a Gun and a Noodle Shop
11             A Woman, a Gun and a Noodle Shop
12                     Bodyguards and Assassins
13                       City of Life and Death
14                             Silver Medallist
15                           Reign of Assassins
16                                         1911
17                     Legend of Kung Fu Rabbit
18               Snow Flower and the Secret Fan
19                           The Flowers of War
20                                    Firestorm
21                                My Lucky Star
22                               Out of Inferno
23                                  Coming Home
24                  Dragon Nest: Warriors' Dawn
25                               Kung Fu Killer
26                       A Tale of Three Cities
27                                 Dragon Blade
28           Mission: Impossible - Rogue Nation
29  Xi you ji zhi: Sun Wukong san da Baigu Jing

### WHERE and AND

Often, you'll want to select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions with the AND keyword.

```sql
SELECT title
FROM films
WHERE release_year > 1994
AND release_year < 2000;
```

gives you the titles of films released between 1994 and 2000.

Note that you need to specify the column name separately for every AND condition!

In [109]:
q = "SELECT title, release_year\
    FROM films\
    WHERE release_year > 1994\
    AND release_year < 2000\
    LIMIT 10;"

db.query(q)

                            title  release_year
0  Ace Ventura: When Nature Calls          1995
1                       Apollo 13          1995
2                       Assassins          1995
3                            Babe          1995
4                        Bad Boys          1995
5                            Bang          1995
6                  Batman Forever          1995
7                  Before Sunrise          1995
8                      Braveheart          1995
9                          Casino          1995

We can also filter all spanish movies released between 2000 and 2010.

In [110]:
q = "SELECT *\
    FROM films\
    WHERE language = 'Spanish'\
    AND release_year > 2000\
    AND release_year < 2010\
    LIMIT 10;"

db.query(q)

     id                                     title  release_year    country  \
0  1695                         Y Tu Mamá También          2001     Mexico
1  1757                 El crimen del padre Amaro          2002     Mexico
2  1807                        Mondays in the Sun          2002      Spain
3  2173                              Live-In Maid          2004  Argentina
4  2175                       Maria Full of Grace          2004   Colombia
5  2246                             The Holy Girl          2004  Argentina
6  2263                            The Sea Inside          2004      Spain
7  2458                       The Legend of Zorro          2005        USA
8  2542  Captain Alatriste: The Spanish Musketeer          2006      Spain
9  2646                           Pan's Labyrinth          2006      Spain

   duration language certification     gross    budget
0       106  Spanish             R  13622333   2000000
1       118  Spanish             R   5709616   1800000
2       113  Spanish             R    146402   4000000
3        83  Spanish       Unrated      null    800000
4       101  Spanish             R   6517198   3000000
5       106  Spanish             R    304124   1400000
6       125  Spanish         PG-13   2086345  10000000
7       129  Spanish            PG  45356386  75000000
8       145  Spanish          null      null  24000000
9       112  Spanish             R  37623143  13500000

### WHERE and OR

What if you want to select rows based on multiple conditions where some but not all of the conditions need to be met? <br> For this, SQL has the **OR** operator.

For example, the following returns all films released in either 1994 or 2000:

```sql
SELECT title
FROM films
WHERE release_year = 1994
OR release_year = 2000;
```

When combining AND and OR, be sure to enclose the individual clauses in parentheses, like so:

```sql
SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
AND (certification = 'PG' OR certification = 'R');
```

### Putting it together: WHERE, AND and OR

Now that we've learned how to filter with the WHERE statement, or with a combination of WHERE, AND and OR, lets put all of this together into a single query that returns all movies with a language "French" OR "Spanish", released between 1990 and 2000, with more than 2.000.000 million dollar gross.

In [111]:
q  = "SELECT title, release_year\
    FROM films\
    WHERE (release_year >= 1990 AND release_year < 2000)\
    AND (language = 'French' OR language = 'Spanish')\
    AND gross > 2000000"
db.query(q)

            title  release_year
0     El Mariachi          1992
1  The Red Violin          1998

### BETWEEN

As you've learned, you can use the following query to get titles of all films released in and between 1994 and 2000:

```sql
SELECT title
FROM films
WHERE release_year >= 1994
AND release_year <= 2000;
```

Checking for ranges like this is very common, so in SQL the **BETWEEN** keyword provides a useful shorthand for filtering values within a specified range. This query is equivalent to the one above:

```sql
SELECT title
FROM films
WHERE release_year
BETWEEN 1994 AND 2000;
```

**Note** It's important to remember that BETWEEN is inclusive, meaning the beginning and end values are included in the results!

In [112]:
q  = "SELECT title\
    FROM films\
    WHERE release_year\
    BETWEEN 1994 AND 2000\
    LIMIT 10;"
db.query(q)

                        title
0          3 Ninjas Kick Back
1      A Low Down Dirty Shame
2  Ace Ventura: Pet Detective
3              Baby's Day Out
4       Beverly Hills Cop III
5       Bullets Over Broadway
6    Clear and Present Danger
7                      Clerks
8                    Crooklyn
9                  Disclosure

In [113]:
q = "SELECT title, release_year\
    FROM films\
    WHERE release_year BETWEEN 1990 AND 2000\
    AND budget > 100000000\
    AND (language = 'Spanish' OR language = 'French');"
db.query(q)

                                     title  release_year
0                 The Horseman on the Roof          1995
1           The Chambermaid on the Titanic          1997
2  Les couloirs du temps: Les visiteurs II          1998
3                                    Tango          1998

The above query returns all Spanish or French language films released between 1990 and 2000, with a budget of more than 10.000.000 million dollars.

### WHERE IN

As you've seen, WHERE is very useful for filtering results. However, if you want to filter based on many conditions, WHERE can get unwieldy. For example:

```sql
SELECT name
FROM kids
WHERE age = 2
OR age = 4
OR age = 6
OR age = 8
OR age = 10;
```

The **IN** operator allows you to specify multiple values in a WHERE clause, making it easier and quicker to specify multiple OR conditions! 

So, the above example would become simply:

```sql
SELECT name
FROM kids
WHERE age IN (2, 4, 6, 8, 10);
```

Get the title and release year of all films released in 1990 or 2000 that were longer than two hours. Notice that duration is given in minutes!

In [114]:
q  = "SELECT title, release_year\
    FROM films\
    WHERE release_year IN (1990, 2000)\
    AND duration > 120;"
db.query(q)

                         title  release_year
0           Dances with Wolves          1990
1                   Die Hard 2          1990
2                        Ghost          1990
3                   Goodfellas          1990
4             Mo' Better Blues          1990
5                 Pretty Woman          1990
6      The Godfather: Part III          1990
7     The Hunt for Red October          1990
8        All the Pretty Horses          2000
9                Almost Famous          2000
10                  Bamboozled          2000
11                   Cast Away          2000
12                    Chocolat          2000
13          Dancer in the Dark          2000
14             Erin Brockovich          2000
15           Finding Forrester          2000
16                        Fiza          2000
17                   Gladiator          2000
18       Gone in Sixty Seconds          2000
19      Hum To Mohabbat Karega          2000
20           Keeping the Faith          2000
21           Love & Basketball          2000
22                Men of Honor          2000
23      Mission: Impossible II          2000
24                Pandaemonium          2000
25              Pay It Forward          2000
26                     Pollock          2000
27               Proof of Life          2000
28                      Quills          2000
29              Reindeer Games          2000
30               Space Cowboys          2000
31                 The 6th Day          2000
32               The Contender          2000
33              The Family Man          2000
34          The House of Mirth          2000
35  The Legend of Bagger Vance          2000
36                 The Patriot          2000
37           The Perfect Storm          2000
38               Thirteen Days          2000
39                     Traffic          2000
40              Vertical Limit          2000
41           What Lies Beneath          2000
42             What Women Want          2000

Get the title and language of all films which were in English, Spanish, or French.

In [115]:
q = "SELECT title, language \
    FROM films \
    WHERE language IN ('English', 'Spanish', 'French')"
db.query(q)

                    title language
0     The Broadway Melody  English
1           Hell's Angels  English
2      A Farewell to Arms  English
3             42nd Street  English
4      She Done Him Wrong  English
...                   ...      ...
4742              Twisted  English
4743          Unforgotten  English
4744                Wings  English
4745           Wolf Creek  English
4746    Wuthering Heights  English

[4747 rows x 2 columns]

### Introduction to NULL and IS NULL

In SQL, NULL represents a missing or unknown value. You can check for NULL values using the expression **IS NULL**. For example, to count the number of missing values in a column of a specific table, we can write:

```sql
SELECT COUNT(*)
FROM table
WHERE column IS NULL;
```

As you can see, IS NULL is useful when combined with WHERE to figure out what data you're missing.

Sometimes, you'll want to filter out missing values so you only get results which are not NULL. To do this, you can use the **IS NOT NULL** operator.

For example, this query gives the names of all people whose birth dates are not missing in the people table.

```sql
SELECT column
FROM table
WHERE column IS NOT NULL;
```

In [165]:
#Get the number of films which don't have a language associated with them.
q  = "SELECT name, deathdate\
    FROM people\
    WHERE deathdate IS NULL"

db.query(q)

Empty DataFrame
Columns: [name, deathdate]
Index: []

### LIKE and NOT LIKE

As you've seen, the WHERE clause can be used to filter text data. However, so far you've only been able to filter by specifying the exact text you're interested in. In the real world, often you'll want to search for a pattern rather than a specific text string.

In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with LIKE:

The % wildcard will match zero, one, or many characters in text. For example, the following query matches companies like 'Data', 'DataC' 'DataCamp', 'DataMind', and so on:

```sql
SELECT name
FROM companies
WHERE name LIKE 'Data%';
```

The _ wildcard will match a single character. For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:

```sql
SELECT name
FROM companies
WHERE name LIKE 'DataC_mp';
```

You can also use the NOT LIKE operator to find records that don't match the pattern you specify.

In [123]:
q  = "SELECT title \
    FROM films\
    WHERE title LIKE 'Lov%';"
db.query(q)

                            title
0                  Love Me Tender
1                    Love Letters
2     Love and Other Catastrophes
3   Love and Death on Long Island
4                      Love Jones
5                     Love Stinks
6               Love & Basketball
7                Lovely & Amazing
8                   Love Actually
9              Love's Abiding Joy
10               Loving Annabelle
11    Love in the Time of Cholera
12                  Lovely, Still
13                   Love Happens
14             Love & Other Drugs
15                     Love Ranch
16   Love in the Time of Monsters
17               Love the Coopers
18                       Lovesick

Get the names of people whose names have 'r' as the second letter. The pattern you need is '_r%'.

In [126]:
q = "SELECT name\
    FROM people\
    WHERE name LIKE '_r%'"

db.query(q)

                  name
0             Ara Celi
1        Aramis Knight
2    Arben Bajraktaraj
3      Arcelia Ramírez
4           Archie Kao
..                 ...
527        Troy Garity
528        Troy Miller
529         Troy Nixey
530     Ursula Andress
531      Wray Crawford

[532 rows x 1 columns]

Get the names of people whose names don't start with A. The pattern you need is 'A%'.

In [128]:
q = "SELECT name\
    FROM people\
    WHERE name NOT lIKE 'A%'"
db.query(q)

                    name
0                50 Cent
1            Álex Angulo
2     Álex de la Iglesia
3          Ángela Molina
4             B.J. Novak
...                  ...
7763         Zohra Segal
7764     Zooey Deschanel
7765       Zoran Lisinac
7766       Zubaida Sahar
7767       Zuhair Haddad

[7768 rows x 1 columns]

## Aggregate functions

Often, you will want to perform some calculation on the data in a database. SQL provides a few functions, called aggregate functions, to help you out with this.

For example,

```sql
SELECT AVG(budget)
FROM films;
```

gives you the average value from the budget column of the films table. Similarly, the MAX() function returns the highest budget:

```sql
SELECT MAX(budget)
FROM films;
```

The SUM() function returns the result of adding up the numeric values in a column:

```sql
SELECT SUM(budget)
FROM films;
```
You can probably guess what the MIN() function does! Now it's your turn to try out some SQL functions.

In [178]:
q  = "SELECT AVG(rating)\
    FROM ratings;"
db.query(q)

   AVG(rating)
0     6.179646

In [179]:
q  = "SELECT MAX(rating)\
    FROM ratings;"
db.query(q)

   MAX(rating)
0         10.0

In [182]:
q  = "SELECT MIN(rating)\
    FROM ratings;"
db.query(q)

   MIN(rating)
0          1.0

In [183]:
q  = "SELECT SUM(rating)\
    FROM ratings;"
db.query(q)

   SUM(rating)
0    1155822.5

### Combining aggregate functions with WHERE
Aggregate functions can be combined with the WHERE clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later

In [129]:
q = "SELECT SUM(budget)\
    FROM films\
    WHERE release_year >= 2010;"
db.query(q)

    SUM(budget)
0  5.493658e+10

In [130]:
q = "SELECT max(gross)\
    FROM films\
    WHERE release_year between 2000 and 2012"

db.query(q)

  max(gross)
0       null

### It's AS simple AS aliasing
You may have noticed in the first exercise of this chapter that the column name of your result was just the name of the function you used. For example,

```sql
SELECT MAX(budget)
FROM films;
```

gives you a result with one column, named max. But what if you use two functions like this?

```sql
SELECT MAX(budget), MAX(duration)
FROM films;
```

Well, then you'd have two columns named max, which isn't very useful!

To avoid situations like this, SQL allows you to do something called aliasing. Aliasing simply means you assign a temporary name to something. To alias, you use the AS keyword, which you've already seen earlier in this course.

For example, in the above example we could use aliases to make the result clearer:

```sql
SELECT MAX(budget) AS max_budget,
       MAX(duration) AS max_duration
FROM films;
```

Aliases are helpful for making results more readable!

## Sorting and grouping

### ORDER BY
Congratulations on making it this far! You now know how to select and filter your results.

In this chapter you'll learn how to sort and group your results to gain further insight. Let's go!

In SQL, the **ORDER BY** keyword is used to sort results in ascending or descending order according to the values of one or more columns.

```sql
SELECT column
FROM table
ORDER BY column;
```

By default ORDER BY will sort in ascending order. If you want to sort the results in descending order, you can use the *DESC* keyword:

```sql
SELECT column
FROM table
ORDER BY column DESC;
```

To order results in descending order, you can put the keyword DESC after your ORDER BY. For example, to get all the names in the people table, in reverse alphabetical order:

```sql
SELECT name
FROM people
ORDER BY name DESC;
```

Now practice using ORDER BY with DESC to sort single columns in descending order!

In [132]:
q  = "SELECT title, release_year\
    FROM films\
    ORDER BY release_year\
    LIMIT 10;"
db.query(q)

                                              title  release_year
0  Intolerance: Love's Struggle Throughout the Ages          1916
1                    Over the Hill to the Poorhouse          1920
2                                    The Big Parade          1925
3                                        Metropolis          1927
4                                     Pandora's Box          1929
5                               The Broadway Melody          1929
6                                     Hell's Angels          1930
7                                A Farewell to Arms          1932
8                                       42nd Street          1933
9                                She Done Him Wrong          1933

In [134]:
q  = "SELECT title, release_year\
    FROM films\
    ORDER BY release_year DESC\
    LIMIT 10;"
db.query(q)

                           title release_year
0                    10,000 B.C.         null
1               A Touch of Frost         null
2               Anger Management         null
3                 Animal Kingdom         null
4                      BrainDead         null
5                         Carlos         null
6                       Creature         null
7             Deadline Gallipoli         null
8  Del 1 - Män som hatar kvinnor         null
9                           Emma         null

In [136]:
q = "SELECT birthdate, name\
    FROM people\
    ORDER BY birthdate"

db.query(q)

       birthdate              name
0     1837-10-10       Robert Shaw
1     1872-11-07  Lucille La Verne
2     1874-03-14         Mary Carr
3     1875-01-22     D.W. Griffith
4     1878-01-20     Finlay Currie
...          ...               ...
8392        null         Zoe Levin
8393        null      Zoe Ventoura
8394        null     Zoran Lisinac
8395        null     Zubaida Sahar
8396        null     Zuhair Haddad

[8397 rows x 2 columns]

In [139]:
q = "SELECT imdb_score, film_id\
    FROM reviews\
    ORDER BY imdb_score DESC"

db.query(q)

      imdb_score  film_id
0            9.5     4960
1            9.3      742
2            9.2      178
3            9.1     4866
4            9.0     3110
...          ...      ...
4963         1.9     2226
4964         1.9     2984
4965         1.9     2452
4966         1.7     3941
4967         1.6     3750

[4968 rows x 2 columns]

### Sorting multiple columns
ORDER BY can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. For example,

```sql
SELECT birthdate, name
FROM people
ORDER BY birthdate, name;
```

sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important!

Try using ORDER BY to sort multiple columns! Remember, to specify multiple columns you separate the column names with a comma.

In [140]:
q  = "SELECT release_year, title\
    FROM films\
    ORDER BY release_year, title\
    LIMIT 10;"
db.query(q)

   release_year                                             title
0          1916  Intolerance: Love's Struggle Throughout the Ages
1          1920                    Over the Hill to the Poorhouse
2          1925                                    The Big Parade
3          1927                                        Metropolis
4          1929                                     Pandora's Box
5          1929                               The Broadway Melody
6          1930                                     Hell's Angels
7          1932                                A Farewell to Arms
8          1933                                       42nd Street
9          1933                                She Done Him Wrong

### GROUP BY

Now you know how to sort results! <br>

Often you'll need to aggregate results. For example, you might want to count the number of male and female employees in your company. Here, what you want is to group all the males together and count them, and group all the females together and count them. In SQL, **GROUP BY** allows you to group a result by one or more columns, like so:

```sql
SELECT sex, count(*)
FROM employees
GROUP BY sex;
```

The resulting could look like this:

|sex   |count|
|------|-----|
|male  |15   |
|female|19   |

**NOTE** Commonly, GROUP BY is used with aggregate functions like COUNT() or MAX(). Note that GROUP BY always goes after the FROM clause!

Now, lets get the release year and largest budget for all films, grouped by release year.

In [141]:
#Group movies by their ratings and count the number of movies per group
q  = "SELECT release_year, max(budget)\
    FROM films\
    group by release_year"
    
db.query(q)

   release_year max(budget)
0          1916      385907
1          1920      100000
2          1925      245000
3          1927     6000000
4          1929        null
..          ...         ...
87         2013        null
88         2014        null
89         2015        null
90         2016        null
91         null        null

[92 rows x 2 columns]

Get the country, release year, and lowest amount grossed per release year per country. Order your results by country and release year.

In [142]:
q = "SELECT country, release_year, MIN(gross)\
    FROM films\
    GROUP BY release_year, country\
    ORDER BY country, release_year"
db.query(q)

          country release_year MIN(gross)
0     Afghanistan         2003    1127331
1       Argentina         2000    1221261
2       Argentina         2004     304124
3       Argentina         2009   20167424
4           Aruba         1998   10076136
..            ...          ...        ...
500  West Germany         1967       null
501  West Germany         1981   11433134
502  West Germany         1984       null
503          null         2014       null
504          null         null       null

[505 rows x 3 columns]

Note that you can combine GROUP BY with ORDER BY to group your results, calculate something about them, and then order your results. For example,

```sql
SELECT sex, count(*)
FROM employees
GROUP BY sex
ORDER BY count DESC;
```

### HAVING a great time

In SQL, aggregate functions can't be used in WHERE clauses. For example, the following query is invalid:

```sql
SELECT release_year
FROM films
GROUP BY release_year
WHERE COUNT(title) > 10;
```

This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the HAVING clause comes in. For example,

```sql
SELECT release_year
FROM films
GROUP BY release_year
HAVING COUNT(title) > 10;
```

shows only those years in which more than 10 films were released.

Now you're going to write a query that returns the average budget and average gross earnings for films in each year after 1990, if the average budget is greater than $60 million.

In [144]:
#Get all title and years that have a title longer than 10 characters
q  = "SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross\
    FROM films\
    WHERE release_year > 1990\
    GROUP BY release_year\
    HAVING AVG(budget) > 60000000"
    
db.query(q)

   release_year    avg_budget     avg_gross
0          2005  6.459620e+07  3.780681e+07
1          2006  8.409824e+07  3.561083e+07

# 2. Joining data with SQL

As the name suggests, the focus of this course is using SQL to join two or more database tables together into a single table, an essential skill for data scientists. In this chapter, you'll learn about the INNER JOIN, which along with LEFT JOIN are probably the two most common JOINs.

## INNER JOIN

Let's begin with a diagram showing the layout of some data and then how an INNER JOIN can be applied to that data.


<figure>
  <img src="images/INNER_JOIN_1.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - We take two tables we want to join. A left table and a right table .</figcaption>
</figure>

You can see that matching values of the id field are colored with the same color. The id field is known as a KEY field since it can be used to reference one table to another. Both the left and right tables also have another field named val. This will be useful in helping you see specifically which records and values are included in each join.

3. INNER JOIN diagram
An INNER JOIN only includes records in which the key is in both tables. 

<figure>
  <img src="images/INNER_JOIN_2.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - An inner join only returns records in which the key is found in both the right and the left table.</figcaption>
</figure>

You can see here that the id field matches for values of 1 and 4 only. With inner joins we look for matches in the right table corresponding to all entries in the key field in the left table.

<figure>
  <img src="images/INNER_JOIN_3.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - Records that do not match are excluded.</figcaption>
</figure>

So the focus here shifts to only those records with a match in terms of the id field. The records not of interest to INNER JOIN have been faded.

Here's a resulting single table from the INNER JOIN clause that gives the val field from the right table with records corresponding to only those with id value of 1 or 4, which are colored as yellow and purple. 


<figure>
  <img src="images/INNER_JOIN_4.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - Result of the inner join.</figcaption>
</figure>

Recall from the video the basic syntax for an INNER JOIN, here including all columns in both tables:

```sql
SELECT *
FROM left_table
INNER JOIN right_table
ON left_table.id = right_table.id;
```

Instead of writing the full table name, you can use table aliasing as a shortcut. For tables you also use AS to add the alias immediately after the table name with a space. Check out the aliasing of cities and countries below.

```sql
SELECT lt.colum AS c1, rt.column AS c2
FROM left_table AS c1
INNER JOIN right_table AS c2
ON c1.id = c2.id;
```

Notice that to select a field in your query that appears in multiple tables, you'll need to identify which table/table alias you're referring to by using a . in your SELECT statement.

Throughout this tutorial, we'll be working with the countries database containing information about the most populous world cities as well as country-level economic data, population data, and geographic data. This countries database also contains information on languages spoken in each country.

Lets connect to the database...

In [209]:
db_countries = DB(db_path = "data/countries.db")

We will now use an INNER JOIN to join the city table with the country table, by matching cities and their corresponding countries using the code column, which is defined as code in the city table and country_code in th country table.

In [210]:
q = "SELECT cities.name, countries.name\
    FROM cities\
    INNER JOIN countries\
    ON cities.country_code = countries.code"

db_countries.query(q)

            name                  name
0        Abidjan         Cote d'Ivoire
1      Abu Dhabi  United Arab Emirates
2          Abuja               Nigeria
3          Accra                 Ghana
4    Addis Ababa              Ethiopia
..           ...                   ...
225      Yerevan               Armenia
226     Yokohama                 Japan
227    Zhengzhou                 China
228    Zhongshan                 China
229        Zunyi                 China

[230 rows x 2 columns]

That worked just fine, but there is one problem with the output. Both columns of the joined table now have the same column name **name**. When using larger tables and multiple joins, the results will be hard to read.
To avoid this problem, we should use aliases.

In [211]:
q = "SELECT cities.name AS city, countries.name AS country\
    FROM cities\
    INNER JOIN countries\
    ON cities.country_code = countries.code"

db_countries.query(q)

            city               country
0        Abidjan         Cote d'Ivoire
1      Abu Dhabi  United Arab Emirates
2          Abuja               Nigeria
3          Accra                 Ghana
4    Addis Ababa              Ethiopia
..           ...                   ...
225      Yerevan               Armenia
226     Yokohama                 Japan
227    Zhengzhou                 China
228    Zhongshan                 China
229        Zunyi                 China

[230 rows x 2 columns]

That looks better! Now the first column has the name **city**, and the second column has the name **country**. <br>
We can even simplify further by assigning aliases to the table names itself.

In [216]:
q = "SELECT c1.name AS city, c2.name AS country\
    FROM cities AS c1\
    INNER JOIN countries AS c2\
    ON c1.country_code = c2.code"

db_countries.query(q)

            city               country
0        Abidjan         Cote d'Ivoire
1      Abu Dhabi  United Arab Emirates
2          Abuja               Nigeria
3          Accra                 Ghana
4    Addis Ababa              Ethiopia
..           ...                   ...
225      Yerevan               Armenia
226     Yokohama                 Japan
227    Zhengzhou                 China
228    Zhongshan                 China
229        Zunyi                 China

[230 rows x 2 columns]

Lets combine data from the countries table with data from the economies table to examine the inflation rate the years 2010 and 2015.

In [218]:
q = "SELECT c.code AS country_code, c.name, e.year, e.inflation_rate\
    FROM countries AS c\
    INNER JOIN economies AS e\
    ON c.code = e.code;"

db_countries.query(q)

    country_code          name  year inflation_rate
0            AFG   Afghanistan  2010          2.179
1            AFG   Afghanistan  2015         -1.549
2            AGO        Angola  2010          14.48
3            AGO        Angola  2015         10.287
4            ALB       Albania  2010          3.605
..           ...           ...   ...            ...
365          ZAF  South Africa  2015          4.575
366          ZMB        Zambia  2010            8.5
367          ZMB        Zambia  2015         10.107
368          ZWE      Zimbabwe  2010          3.045
369          ZWE      Zimbabwe  2015          -2.41

[370 rows x 4 columns]

#### Multiple INNER JOINS

Now, for each country, you want to get the country name, its region, the fertility rate, and the unemployment rate for both 2010 and 2015.

In [222]:
q = "SELECT c.code, name, region, e.year, fertility_rate, unemployment_rate\
  FROM countries AS c\
  INNER JOIN populations AS p\
    ON c.code = p.country_code\
  INNER JOIN economies AS e\
    On c.code = e.code AND e.year = p.year;"

db_countries.query(q)

    code         name                     region  year fertility_rate  \
0    AFG  Afghanistan  Southern and Central Asia  2015          4.653
1    AFG  Afghanistan  Southern and Central Asia  2010          5.746
2    ALB      Albania            Southern Europe  2015          1.793
3    ALB      Albania            Southern Europe  2010          1.663
4    DZA      Algeria            Northern Africa  2015          2.805
..   ...          ...                        ...   ...            ...
365  ZMB       Zambia             Eastern Africa  2015          5.284
366  ZMB       Zambia             Eastern Africa  2010          5.687
367  ZWE     Zimbabwe             Eastern Africa  2015          3.856
368  ZWE     Zimbabwe             Eastern Africa  2010          4.048
369  ERI      Eritrea             Eastern Africa  2015          4.207

    unemployment_rate
0
1
2                17.1
3                14.0
4              11.214
..                ...
365
366
367
368
369

[370 rows x 6 columns]

#### How multiple joins work

WRITE HOW MULTIPLE JOINS WORK!!!

### INNER JOIN via USING

When joining tables with a common field name, e.g.

```sql
SELECT *
FROM countries
  INNER JOIN economies
    ON countries.code = economies.code
```

You can use USING as a shortcut:

```sql
SELECT *
FROM countries
  INNER JOIN economies
    USING(code)
```

### Self-ish JOIN, just in CASE

Often it's useful to look at a numerical field not as raw data, but instead as being in different categories or groups.

You can use CASE with WHEN, THEN, ELSE, and END to define a new grouping field.

```sql
SELECT name, continent, code, surface_area,
    -- First case
    CASE WHEN surface_area > 2000000 THEN 'large'
        -- Second case
        WHEN surface_area > 350000 THEN 'medium'
        -- Else clause + end
        ELSE 'small' END
        -- Alias name
        AS geosize_group
-- From table
FROM countries;
````

## Outer joins (LEFT (OUTER) JOIN and RIGHT (OUTER) JOIN) and Cross joins

You can remember outer joins as reaching OUT to another table while keeping all of the records of the original table. Inner joins keep only the records IN both tables. You'll by exploring 
- LEFT JOINs
- RIGHT JOINs and
- FULL JOINs

These are the three types of OUTER JOINs.

## LEFT and RIGHT JOINs

Let's begin by exploring how a LEFT JOIN differs from an INNER JOIN via a diagram.

Recall how the inner join works: The only records that were included in the resulting table of the INNER JOIN query were those in which the id field had matching values.

<figure>
  <img src="images/INNER_JOIN.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - INNER JOIN diagram.</figcaption>
</figure>

In contrast, a LEFT JOIN notes those records in the left table that do not have a match on the key field in the right table. This is denoted in the diagram by the open circles remaining close to the left table for id values of 2 and 3. These values of 2 and 3 do not appear in the id field of the right table.

<figure>
  <img src="images/LEFT_JOIN.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - LEFT JOIN diagram.</figcaption>
</figure>

Whereas the INNER JOIN kept just the records corresponding to id values of 1 and 4, a LEFT JOIN keeps all of the original records in the left table but then marks the values as missing in the right table for those that don't have a match. The missing values are marked with dark gray boxes here for clarity. Note that the values of 5 and 6 for id in the right table are not found in the result of LEFT JOIN in any way.

It isn't always the case that each key value in the left table corresponds to exactly one record in the key column of the right table. In these examples, we have this layout. Missing entries still occur for ids of 2 and 3 and the value of R3 is brought into the join from right2 since it matches on id 4. Duplicate rows are shown in the LEFT JOIN for id 1 since it has two matches corresponding to the values of R1 and R2 in the right2 table.

<figure>
  <img src="images/LEFT_JOIN_2.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - LEFT JOIN diagram.</figcaption>
</figure>

The syntax of the LEFT JOIN is similar to that of the INNER JOIN:

```sql
SELECT p1.country, prime_minister, president
FROM prime_ministers as p1
LEFT JOIN presidents as p2
ON p1.country = p2.country;
```

The RIGHT JOIN is much less common than the LEFT JOIN so we won't spend as much time on it here. The diagram will help you to understand how it works. Instead of matching entries in the id column on the left table TO the id column of the right table, a RIGHT JOIN does the reverse. Therefore, we see open circles on the ids of 5 and 6 in the right table since they are not found in the left table. The resulting table from the RIGHT JOIN shows these missing entries in the L_val field. As you can see in SQL the right table appears after RIGHT JOIN and the left table appears after FROM.

<figure>
  <img src="images/RIGHT_JOIN.png" alt="INNER JOIN" style="width:20%">
  <figcaption>Fig. - RIGHT JOIN diagram.</figcaption>
</figure>

## FULL JOIN

A FULL JOIN combines a LEFT JOIN and a RIGHT JOIN as you can see by looking at this diagram. So it will bring in all records from both the left and the right table and keep track of the missing values accordingly.

Note the missing values here and that all six of the values of id are included in the table. You can also see from the SQL code to produce this FULL JOIN result that the general format aligns closely with the SQL syntax you've seen for both an INNER JOIN and a LEFT JOIN.

<figure>
  <img src="images/FULL_JOIN.png" alt="FULL JOIN" style="width:60%">
  <figcaption>Fig. - FULL JOIN diagram.</figcaption>
</figure>

## CROSS JOIN, CROSSing the Rubicon

Now that you've worked with INNER JOINs and OUTER JOINs it's time to check out the CROSS JOIN. CROSS JOINs create all possible combinations of two tables. Let's explore the diagram for a CROSS JOIN next.

<figure>
  <img src="images/CROSS_JOIN.png" alt="CROSS_JOIN" style="width:20%">
  <figcaption>Fig. - CROSS_JOIN diagram.</figcaption>
</figure>

In this diagram we have two tables named table1 and table2. Each table only has one field, both with the name of id. The result of the CROSS JOIN is all nine combinations of the id values of 1, 2, and 3 in table1 with the id values of A, B, and C for table2.

Suppose that all prime ministers in North America and Oceania in the prime_ministers table are scheduled for individual meetings with all presidents in the presidents table. You can look at all of these combinations by using a CROSS JOIN. The syntax here remains similar to what you've seen earlier in the course. We use a WHERE clause to focus on only prime ministers in North America and Oceania in the prime_ministers table. The results of the query give us the pairings for the two prime ministers in North America and Oceania from the prime_ministers table with the seven presidents in the presidents table.

```sql
SELECT prime_minister, president
FROM prime_ministers as p1
CROSS JOIN presidents as p2
WHERE p1.continent IN('North America', 'Oceacia')
```

## Set theory clauses

Next are set theory clauses. In this video, we'll focus on the operations of UNION and UNION ALL. In addition to joining diagrams, in this chapter, you'll also see how Venn diagrams can be used to represent set operations. Let's begin with these Venn diagrams now.

<figure>
  <img src="images/VENN_DIAGRAM.png" alt="CROSS_JOIN" style="width:60%">
  <figcaption>Fig. - VENN diagrams.</figcaption>
</figure>

You can think of each circle as representing a table of data. The shading represents what is included in the result of the set operation from each table.
- **UNION** includes every record in both tables but DOES NOT double count those that are in both tables. 
- **UNION ALL** includes every record in both tables and DOES replicate those that are in both tables. This is why the center is shaded black. The two diagrams on the bottom represent only subsets of data being selected. 
- **INTERSECT** results in only those records found in both of the two tables. 
- **EXCEPT** results in only those records in one table BUT NOT the other. Let's investigate what UNION looks like as a joining diagram.

### UNION and UNION ALL

In the below diagram, you have two tables with names left_one and right_one. The "one" here corresponds to each table only having one field. If you run a **UNION** on these two fields you get each record appearing in either table, but notice that the id values of 1 and 4 in right_one are not included again in the UNION since they were already found in the left_one table.

<figure>
  <img src="images/UNION.png" alt="UNION" style="width:20%">
  <figcaption>Fig. - UNION.</figcaption>
</figure>


By contrast (with the same two tables left_one and right_one), **UNION ALL** includes all duplicates in its result. So left_one and right_one both having four records yields eight records for the result of the UNION ALL. If it were the case that right_one had these same four values and also one more value of 1 for id, you'd see three entries for 1 in the resulting UNION ALL. 

<figure>
  <img src="images/UNION_ALL.png" alt="UNION_ALL" style="width:20%">
  <figcaption>Fig. - UNION_ALL.</figcaption>
</figure>


Let's check out the SQL syntax using the leaders database for both UNION and UNION ALL, but first you'll see one more table in the leaders database.

```sql
SELECT prime_minister AS leader, country
FROM prime_ministers
UNION
SELECT monarch, country
FROM monarchs
ORDER BY country;
```

You can use UNION on the prime_ministers and monarchs table to show all of the different prime ministers and monarchs in these two tables. The country field is also included here for reference. Note that the prime_minister field has been aliased as leader. In fact, the resulting field from the UNION will have the name of leader. That's an important property of the set theory clauses you will see in this chapter. The fields included in the operation must be of the same data type since they come back as just a single field. You can't stack a number on top of a character field in other words.

Our resulting table from the UNION gives all the leaders and their corresponding country. 

<figure>
  <img src="images/UNION_TABLE.png" alt="UNION_TABLE" style="width:50%">
  <figcaption>Fig. - Query result using UNION.</figcaption>
</figure>

Does something stand out to you here?


The countries of Brunei and Oman were listed only once in the UNION table. These countries have monarchs that also act as prime ministers. This can be seen in the UNION ALL results.

```sql
SELECT prime_minister AS leader, country
FROM prime_ministers
UNION ALL
SELECT monarch, country
FROM monarchs
ORDER BY country;
LIMIT 10
```
<figure>
  <img src="images/UNION_ALL_TABLE.png" alt="UNION_ALL_TABLE" style="width:30%">
  <figcaption>Fig. - Query result using UNION ALL.</figcaption>
</figure>

You've seen that UNION and UNION ALL clauses do not do the lookup step that JOINs do. They simply stack records on top of each other from one table to the next.

### INTERCEPTional data

You saw with UNION and UNION ALL via examples that they do not do quite the same thing as what a join does. They only bind fields on top of one another in the two tables. The set theory clause **INTERSECT** works in a similar fashion to UNION and UNION ALL, but remember from the Venn diagram that INTERSECT only includes those records in common to both tables and fields selected. Let's investigate the diagram for INTERSECT and the corresponding SQL code to achieve it.

<figure>
  <img src="images/INTERCECT.png" alt="INTERCECT" style="width:40%">
  <figcaption>Fig. - INTERCECT.</figcaption>
</figure>


The result of the INTERSECT on left_one and right_one is only the records in common to both left_one and right_one: 1 and 4. Let's next see how you could use INTERSECT to determine all countries having both a prime minister and a president.

<figure>
  <img src="images/INTERCECT_TABLE.png" alt="INTERCECT_TABLE" style="width:20%">
  <figcaption>Fig. - Query result using INTERCECT.</figcaption>
</figure>

The code for each of these set operations has a similar layout. You first select which fields you'd like to include in your first table, and then you specify the name of the first table. Next you specify the set operation to perform. Lastly, you denote which fields in the second table you'd like to include and then the name of the second table. The result of the query is the four countries with both a prime minister and a president in the leaders database.

Next, let's think about what would happen if we tried to select two columns instead of one from our previous example. The code shown does just that. 

<figure>
  <img src="images/INTERCECT_TABLE_2.png" alt="INTERCECT_TABLE_2" style="width:30%">
  <figcaption>Fig. - Query result using INTERCECT and two selected columns.</figcaption>
</figure>

What will be the result of this query? Will this also give you the names of the countries that have both a prime minister and a president? Hmmm [PAUSE] The actual result is an empty table. Why is that? When INTERSECT looks at two columns it includes both columns in the search. So it didn't find any countries with prime ministers AND presidents having the same name. INTERSECT looks for RECORDS in common, not individual key fields like what a join does to match. This is an important distinction.

### EXCEPTional 

**EXCEPT** allows you to include only the records that are in one table, but not the other. Let's mix things up and look into the SQL code and result first and then dive into the diagram.

This diagram gives the structure of EXCEPT clauses. Only the records that appear in the left table BUT DO NOT appear in the right table are included.

<figure>
  <img src="images/EXCEPT.png" alt="EXCEPT" style="width:20%">
  <figcaption>Fig. - EXCEPT.</figcaption>
</figure>

### Semi-joins and Anti-joins

1. Semi-joins and Anti-joins
You'll now close this chapter by returning to joins. The six joins you've worked with so far are all additive joins in that they add columns to the original "left" table:

1. INNER JOIN
2. self-join
3. LEFT JOIN
4. RIGHT JOIN
5. FULL JOIN
6. CROSS JOIN

The last two joins we will cover use a right table to determine which records to keep in the left table. In other words, you use these last two joins (semi-join and anti-join) in a way similar to a WHERE clause dependent on the values of a second table. 

Let's try out some examples of semi-joins and anti-joins and then return to the diagrams for each. Suppose that you are interested in determining the presidents of countries that gained independence before 1800. Let's first determine which countries this corresponds to in the states table. Recall from your knowledge of SQL before you knew anything about JOINs how this could be done. To get only the countries meeting this condition you can use the WHERE clause. 

```sql
SELECT name
FROM states
WHERE indep_year < 1800;
```

We'll next set up the other part of the query to get the presidents we want. What code is needed to retrieve the president, country, and continent columns from the presidents table in that order?
Now we need to use this result with the one in the previous slide to further filter the country field in the presidents table to give us the correct result. Let's see how this might be done next.

```sql
SELECT president, country, continent
FROM presidents;
```

In the first query of this example, we determined that Portugal and Spain were both independent before 1800. In the second query, we determined how to display the table in a nice form to answer our question. In order to combine the two tables together we will again use a WHERE clause and then use the first query as the condition to check in the WHERE clause. Check it out! 

```sql
SELECT president, country, continent
FROM presidents
WHERE country IN
    (SELECT name 
     FROM states
     WHERE indep_year < 1800)
```
This is your first example of a subquery: a query that sits inside of another query. You'll explore these more in Chapter 4. What does this give as a result? Is it the presidents of Spain and of Portugal? Since Spain does not have a president, it is not included here and only the Portuguese president is listed. The semi-join chooses records in the first table where a condition IS met in a second table. An anti-join chooses records in the first table where a condition IS NOT met in the second table. 

How might you determine countries in the Americas founded after 1800?
Using the code from the previous example, you only need to add a few pieces of code. 

```sql
SELECT president, country, continent
FROM presidents
WHERE continent LIKE '%America'
    AND country NOT IN
    (SELECT name 
     FROM states
     WHERE indep_year < 1800)
```

Fill in the WHERE clause by choosing only those continents ending in America and then fill in the other space with a NOT to exclude those countries in the subquery. The presidents of countries in the Americas founded after 1800 are given in the table.

The **semi-join** matches records by key field in the right table with those in the left. 


<figure>
  <img src="images/SEMI_JOIN.png" alt="SEMI_JOIN" style="width:20%">
  <figcaption>Fig. - SEMI_JOIN.</figcaption>
</figure>


It then picks out only the rows in the left table that match that condition. 

The **anti-join** picks out those columns in the left table that do not match the condition on the right table. 


<figure>
  <img src="images/ANTI_JOIN.png" alt="ANTI_JOIN" style="width:20%">
  <figcaption>Fig. - ANTI_JOIN.</figcaption>
</figure>

Semi-joins and anti-joins don't have the same built-in SQL syntax that INNER JOIN and LEFT JOIN have. They are useful tools in filtering one table's records on the records of another table.

### Subqueries inside WHERE and SELECT clauses

This last chapter is focused on embedding queries inside of queries. These are called nested queries and also known as subqueries as you saw in Chapter 3. The most common type of subquery is one inside of a WHERE statement. Let's check out another one of these now with a little bit of setting up to do first, of course.

You've seen many examples of using a subquery inside a WHERE clause already with the semi-join and anti-join examples and exercises you just completed. With the WHERE clause being the most common place for a subquery to be found, it's important that you see just one more example of doing so. With this being the final chapter, it's time to unveil the remaining fields in the states table. Note that the continent field is not shown to display all the fields here. 

<figure>
  <img src="images/Subquery_TABLE.png" alt="Subquery_TABLE" style="width:40%">
  <figcaption>Fig. - Table used in this chapter.</figcaption>
</figure>

The fert_rate field gives an estimate for the average number of babies born per woman in each country. The women_parli_perc field gives the percentage of women in the elected federal parliament for each country. Across these 13 countries, how would you determine the average fertility rate?
We will use the average fertility rate as part of a subquery. Recall how this is done. 


```sql
SELECT AVG(fert_rate)
FROM states
```
The average babies born to women across these countries is 2-point-28 children.

Let's use the previous slide's query as a subquery to determine Asian countries that fall under this average. You'll see the code in a couple steps. 

```sql
SELECT name, fert_rate
FROM states
WHERE continent = 'Asia'
```
First we select the country name and the fertility rate for Asian countries.

Next, we want to choose records where fert_rate is smaller than What comes next?
The subquery is to get the average fertility rate! 


```sql
SELECT name, fert_rate
FROM states
WHERE continent = 'Asia'
AND fert_rate <
    (SELECT AVG(fert_rate)
    FROM states);
```
And now we can check out our result to make sure it makes sense.


| name    | fert_rate |
| ------- | --------- |
| Brunei  | 1.96      |
| Vietnam | 1.7       |

It appears so. These are the two Asian countries we were looking for with fertility rates below 2-point-28 babies per woman.

The second most common type of a subquery is inside of a SELECT clause. The task here is to count the number of countries listed in the states table for each continent in the prime_ministers table. Let's again take the stepwise approach to setting up the problem. What does this code do? 

```sql
SELECT DISTINCT continent
FROM prime_ministers;
```

It gives each of the five continents in the prime_ministers table. 

| continent     |
| ------------- | 
| Africa        |
| Asia          |
| Europe        |
| North America |
| Oceania       |

Let's keep building...
Next is determining the counts of the number of countries in states for each of the continents in the last slide. Combining a COUNT clause with a WHERE statement matching the continent fields in the two tables gets us there. Let's check out the code and then discuss a bit further. 

```sql
SELECT DISTINCT continent
    (SELECT COUNT(*)
    FROM states 
    WHERE prime_ministers.continent = states.continent AS countries_num)
FROM prime_ministers;
```
The subquery involving states also can reference the prime_ministers table in the main query. Any time you do a subquery inside a SELECT statement like this, you need to give the subquery an alias like countries_num here. 

| continent     | countries_num |
| ------------- | ------------- |
| Africa        | 2             |
| Asia          | 4             |
| Europe        | 3             |
| North America | 1             |
| Oceania       | 1             |


It's kinda like magic that this works, huh?! If you haven't discovered it already, there are often many different ways to solve problems with SQL queries. You could use a carefully constructed JOIN to achieve this same result, for example.

### Subquery inside the FROM clause

The last basic type of a subquery exists inside of a FROM clause. A motivating example pertaining to the percentage of women in parliament will be used now to help you understand this style of subquery.

First, let's determine the maximum percentage of women in parliament for each continent listed in states. 

```sql
SELECT continent, MAX(woman_parli_perc) AS max_perc
FROM states
GROUP BY continent
ORDER BY continent;   
```

Recall that this query will only work if you include continent as one of the fields in the SELECT clause since we are grouping based on that field. Let's check out the result. 

| continent     | max_perc      |
| ------------- | ------------- |
| Africa        | 14.9          |
| Asia          | 24            |
| Europe        | 39.6          |
| North America | 2.74          |
| Oceania       | 32.74         |
| South America | 22.31         |

We see that Europe has the largest value and North America has the smallest value for the countries listed in the states table.

What if you weren't interested in all continents, but specifically those in the monarchs table. You haven't seen this yet in the course but you can include multiple tables in a FROM clause by adding a comma between them. Let's investigate a way to get the continents only in monarchs using this new trick. 

```sql
SELECT monarchs.continent
FROM monarchs, states
WHERE monarchs.continent = states.continent
ORDER BY continent;   
```

| continent     | 
| ------------- | 
| Asia          | 
| Asia          | 
| Asia          | 
| Asia          |
| Asia          |
| Asia          |
| Asia          |
| Asia          |
| Asia          |
| Europe        |
| Europe        |
| Europe        |
| Europe        |
| Europe        |
| Europe        |

We have at least part of our answer here, but how do we get rid of those duplicate entries? And what about the maximum column?

To get Asia and Europe to appear only once, use the DISTINCT command in your SELECT statement. But now how do you get that maximum column to also come along with Asia and Europe? Instead of including states in the FROM clause, include the subquery instead and alias it with a name like subquery. There you have it! That's how to include a subquery as a temporary table in your FROM clause.

```sql
SELECT DISTINCT monarchs.continent, subquery.max_perc
FROM monarchs
    (SELECT continent, MAX(woman_parli_perc) AS max_perc
     FROM states
     GROUP BY continent) AS subquery
WHERE monarchs.continent = subquery.continent
ORDER BY continent;   
```


| continent     | max_perc      |
| ------------- | ------------- |
| Asia          | 24            |
| Europe        | 39.6          |

# 3. Intermediate SQL

For this course, we will be using the European Soccer Database -- a relational database that contains data about over 25,000 matches, 300 teams, and 10,000 players in Europe between 2008 and 2016. The data is contained within 4 tables -- country, league, team, and match. Selecting from tables in this database is pretty simple. 

```sql
SELECT
    l.name AS league,
    COUNT(m.country_id) AS total_matches
FROM league as l
LEFT JOIN match AS m
ON l.country_id = m.country_id
GROUP BY l.name;
```

| league                 | total_matches    |
| ---------------------- | ---------------- |
| Belgium Jupiler League | 732              |
| England Premier League | 1520             | 
| France Ligue 1         | 1520             |
| Germany 1. Bundesliga  | 1224             |

The query you see here gives you the number of matches played in each of the 11 leagues listed in the "League" table.

## CASE statement

Let's say we want to compare the number of home team wins, away team wins, and ties in the 2013/2014 season. The "Match" table has two relevant columns -- home_goal, and away_goal.

```sql
SELECT date, id, home_goal, away_goal
FROM matches
WHERE season = '2013/2014'
```

| date                   | id               | home_goal | away_goal |
| ---------------------- | ---------------- | --------- | --------- |
| 2014-03-29             | 1237             | 2         | 0         | 
| 2014-03-29             | 1238             | 0         | 1         |
| 2014-05-04             | 1239             | 1         | 0         |
| 2014-05-04             | 1240             | 0         | 0         |

We can potentially add filters to the WHERE clause selecting wins, loses, and ties as separate queries, but that's not very efficient if you want to compare these separate outcomes in a single data set.

```sql
SELECT date, id, home_goal, away_goal
FROM matches
WHERE season = '2013/2014'
AND home_team_goal > away_team_goal
```

| date                   | id               | home_goal | away_goal |
| ---------------------- | ---------------- | --------- | --------- |
| 2014-03-29             | 1237             | 2         | 0         | 
| 2014-05-04             | 1239             | 1         | 0         |
| 2014-04-12             | 1241             | 2         | 1         |
| 2014-04-12             | 1242             | 2         | 0         |

This is where the **CASE** statement comes in. Case statements are SQL's version of an "IF this THEN that" statement. Case statements have three parts:
- a WHEN clause
- a THEN clause and 
- an ELSE clause. 

The first part -- the WHEN clause -- tests a given condition, say, x = 1. 

```sql
CASE WHEN x = 1 THEN 'a'
     WHEN x = 2 THEN 'b'
     ELSE 'c' END AS new_column
```

If this condition is TRUE, it returns the item you specify after your THEN clause. You can create multiple conditions by listing WHEN and THEN statements within the same CASE statement. The CASE statement is then ended with an ELSE clause that returns a specified value if all of your when statements are not true. When you have completed your statement, be sure to include the term END and give it an alias. The completed CASE statement will evaluate to one column in your SQL query.

**Note:** There are more ways of structuring CASE statements, in example using arithmetic functions such as COUNT, SUM, and AVERAGE.

## More complex CASE statements


Now that you understand the basics of CASE statements, let's set up some more complex logical tests.

### CASE WHEN ... AND then some

If you want to test multiple logical conditions in a CASE statement, you can use AND inside your WHEN clause. For example, let's see if each match was played, and won, by the team Chelsea. 

```sql
SELECT date, hometeam_id, awayteam_id,
    CASE WHEN hometeam_id = 8455 AND home_goal > away_goal THEN 'Chelsea home win!'
    WHEN awayteam_id = 8455 AND home_goal < away_goal THEN 'Chelsea away win!'
    ELSE 'Loss or tie :(' END AS outcome
FROM match
WHERE hometeam_id = 8455 OR awayteam_id = 8455;
```


Let's see the CASE statement in this query. Each WHEN clause contains two logical tests -- the first tests if a hometead_id identifies Chelsea, AND then it tests if the home team scored higher than the away team. If both conditions are TRUE, the new column output returns the phrase "Chelsea home win!". The opposite set of conditions are included in a second when statement -- if the awayteam_id belongs to Chelsea, AND scored higher, then the output returns "Chelsea away win!". All other matches are categorized as a loss or tie. Here's the resulting table.


| date                   |hometeam_id | awayteam_id | outcome           |
| ---------------------- | ---------- | ----------- | ----------------- |
| 2011-08-14             | 10194      | 8455        | Loss or tie :(    | 
| 2011-08-20             | 8455       | 8659        | Chelsea home win! |
| 2011-08-27             | 8455       | 9850        | Chelsea home win! |
| 2011-09-10             | 8472       | 8455        | Chelsea home win! |


When testing logical conditions, it's important to carefully consider which rows of your data are part of your ELSE clause, and if they're categorized correctly. Here's the same CASE statement from the previous slide, but the WHERE filter has been removed. 

```sql
SELECT date, hometeam_id, awayteam_id,
    CASE WHEN hometeam_id = 8455 AND home_goal > away_goal THEN 'Chelsea home win!'
    WHEN awayteam_id = 8455 AND home_goal < away_goal THEN 'Chelsea away win!'
    ELSE 'Loss or tie :(' END AS outcome
FROM match
```

Without this filter, your ELSE clause will categorize ALL matches played by anyone, who don't meet these first two conditions, as "Loss or tie :(". 

The easiest way to correct for this is to ensure you add specific filters in the WHERE clause that exclude all teams where Chelsea did not play. Here, we specify this by using an OR statement in WHERE, which retrieves only results where the id 8455 is present in the hometeam_id or awayteam_id columns. The resulting table from earlier, with the team IDs in bold here, clearly specifies whether Chelsea was home or away team.

It's also important to consider what your ELSE clause is doing. 
Let's say we're only interested in viewing the results of games where Chelsea won, and we don't care if they lose or tie. Just like in the previous example, simply removing the ELSE clause will still retrieve those results -- and a lot of NULL values.

```sql
SELECT date, season
    CASE WHEN hometeam_id = 8455 AND home_goal > away_goal THEN 'Chelsea home win!'
    WHEN awayteam_id = 8455 AND home_goal < away_goal THEN 'Chelsea away win!'
    END AS outcome
FROM match
WHERE hometeam_id = 8455 OR awayteam_id = 8455;
```


| date                   |season      |  outcome           |
| ---------------------- | ---------- | ------------------ |
| 2011-08-14             | 2011/2012  |  NULL              | 
| 2011-12-22             | 2011/2012  |  NULL              |
| 2012-12-08             | 2012/2013  |  Chelsea away win! |
| 2013-03-02             | 2012/2013  |  Chelsea home win! |


To correct for this, you can treat the entire CASE statement as a column to filter by in your WHERE clause, just like any other column. In order to filter a query by a CASE statement you include the entire CASE statement, except its alias, in WHERE. You then specify what you want to include, or exclude. For this query, I want to keep all rows where this CASE statement IS NOT NULL. My resulting table now only includes Chelsea's home and away wins -- and I don't need to filter by their team ID anymore!

```sql
SELECT date, hometeam_id, awayteam_id,
    CASE WHEN hometeam_id = 8455 AND home_goal > away_goal THEN 'Chelsea home win!'
    WHEN awayteam_id = 8455 AND home_goal < away_goal THEN 'Chelsea away win!'
    ELSE 'Loss or tie :(' END AS outcome
FROM match
WHERE CASE WHEN hometeam_id = 8455 AND home_goal > away_goal THEN 'Chelsea home win!'
    WHEN awayteam_id = 8455 AND home_goal < away_goal THEN 'Chelsea away win!'
    END IS NOT NULL
```

### CASE WHEN with aggregate functions

Let's take a look at CASE statements with aggregate functions.

CASE statements can be used to 
- **create columns** for categorizing data
- **filter** your data in the WHERE clause and
- **aggregate** data based on the result of a logical test.

Let's say you wanted to prepare a summary table counting the number of home and away games that Liverpool won in each season. If you've created summary tables in Spreadsheets, you can probably visualize the final table, here -- but how do you get a count of Liverpool's wins in each season?

You guessed it -- a CASE statement. CASE statements are like any other column in your query, so you can include them inside an aggregate function. Take a look at this CASE statement:

```sql
SELECT season,
    COUNT(CASE WHEN hometeam_id = 8650
          AND home_goal > away_goal 
          THEN id END) AS home_wins
FROM match
GROUP BY season
``` 

The WHEN clause includes a similar logical test to the previous lesson -- did Liverpool play as the home team, AND did the home team score higher than the away team? The difference begins in your THEN clause. Instead of returning a string of text, you return the column identifying the unique match id. When this CASE statement is inside the COUNT function, it COUNTS every id returned by this CASE statement.

You then add a second CASE statement for the away team, and group the query by the season. 

```sql
SELECT season,
    COUNT(CASE WHEN hometeam_id = 8650
          AND home_goal > away_goal 
          THEN id END) AS home_wins
    COUNT(CASE WHEN awayteam_id = 8650
          AND away_goal > home_goal 
          THEN id END) AS away_wins
FROM match
GROUP BY season
``` 
| season    | home_wins | away_wins |
| --------- | --------- | --------- |
| 2011/2012 | 6         | 8         |
| 2012/2013 | 9         | 7         |
| 2013/2014 | 16        | 10        |
| 2014/2015 | 10        | 8         |


When counting information in a CASE statement, you can return anything you'd like a number, a string of text, or any column in the table, SQL is COUNTing the number of rows returned by the CASE statement.

Similarly, you can use the **SUM** function to calculate a total of any value. Let's say we're interested in the number of home and away goals that Liverpool scored in each season. This is fairly simple to set up: 


```sql
SELECT season,
    SUM(CASE WHEN hometeam_id = 8650
          THEN home_goal END) AS home_goals,
    SUM(CASE WHEN awayteam_id = 8650 
          THEN away_goal END) AS away_goals
FROM match
GROUP BY season
``` 

if the hometeam_id is Liverpool's, return the home_goal value. The ELSE condition is assumed to be NULL, so the query returns the total home_goals scored by Liverpool in each season.

| season    | home_goals | away_goals |
| --------- | ---------- | ---------- |
| 2011/2012 | 24         | 23         |
| 2012/2013 | 33         | 38         |
| 2013/2014 | 53         | 48         |
| 2014/2015 | 30         | 22         |


You can also use the **AVG** function with CASE in two key ways. First, you can calculate an average of data. You can do this using CASE in the EXACT same way you used the SUM function. Just change out SUM for AVG in this query, and you instead get the AVG goals Liverpool scored in each season.

```sql
SELECT season,
    AVG(CASE WHEN hometeam_id = 8650
          THEN home_goal END) AS avg_home_goals,
    AVG(CASE WHEN awayteam_id = 8650 
          THEN away_goal END) AS avg_away_goals
FROM match
GROUP BY season
``` 

You can make the results easier to read using ROUND. ROUND takes 2 arguments -- a numerical value, and the number of decimal points to round the value to. Place it outside your aggregate CASE statement, and include the number of decimal points at the end. There, that's much easier to read!

```sql
SELECT season,
    ROUND(AVG(CASE WHEN hometeam_id = 8650
          THEN home_goal END),2) AS avg_home_goals,
    ROUND(AVG(CASE WHEN awayteam_id = 8650 
          THEN away_goal END),2) AS avg_away_goals
FROM match
GROUP BY season
``` 

| season    | avg_home_goals | avg_away_goals |
| --------- | ------------ | ---------------- |
| 2011/2012 | 1.26         | 1.21             |
| 2012/2013 | 1.73         | 2                |
| 2013/2014 | 2.78         | 2.52             |
| 2014/2015 | 1.57         | 1.15             |


The second key application of CASE with AVG is in the calculation of percentages. This requires a specific structure in order for your calculation to be accurate. The question we're answering here is, "What percentage of Liverpool's games did they win in each season?" 

```sql
SELECT season,
    ROUND(AVG(CASE WHEN hometeam_id = 8455 AND home_goal > away_goal THEN 1
             WHEN hometeam_id = 8455 AND home_goal < away_goal THEN 0
             END),2) AS pct_homewins,
    ROUND(AVG(CASE WHEN hometeam_id = 8455 AND away_goal > home_goal THEN 1
             WHEN hometeam_id = 8455 AND away_goal < home_goal THEN 0
             END),2) AS pct_awaywins,
FROM match
GROUP BY season
``` 

| season    | pct_homewins | pct_awaywins |
| --------- | ------------ | -------------|
| 2011/2012 | 0.75         | 0.5          |
| 2012/2013 | 0.86         | 0.67         |
| 2013/2014 | 0.94         | 0.67         |
| 2014/2015 | 1            | 0.79         |


The first component of this CASE statement is a WHEN clause identifying what you're calculating a percentage of -- in this case, how many games did they win? This is tested in the same way as previous slides, and your THEN clause returns a 1. The second component identifies Liverpool's games that they LOST, and returns the value 0. All other matches -- ties, games not involving Liverpool -- are excluded as NULLs. Here are the results of this query ...

## Subqueries

In this chapter, we will cover the use of simple subqueries to extract and transform your data.

A subquery is a query nested inside another query. You can tell that there is a subquery in your SQL statement if you have an additional SELECT statement contained inside parentheses, surrounded by another complete SQL statement. 

```sql
SELECT column
FROM (SELECT column
      FROM table) AS subquery;
```
So why is this important? Often, in order to retrieve information you want, you have to perform some intermediary transformations to your data before selecting, filtering, or calculating information. Subqueries are a common way of performing this transformation.

A subquery can be placed in **any** part of your query -- such as the SELECT, FROM, WHERE, or GROUP BY clause. Where you place it depends on what you want your final data to look like. A subquery can return a variety of information, such as scalar quantities, or numbers, like the ones listed here. A subquery can return a list to use for filtering or joining information, or it can return a table to extract and further transform data.

**Why subqueries?**
Subqueries allow you to compare summarized values to detailed data:

- comparing groups to summarize data 
    - *compare Liverpool's performance to the entire English Premier League* 
- Reshaping data
    - *determining the highest monthly average of goals scored in the Bundesliga*
- Combining data that cannot be joined
    - *getting both the home and away team names into your results table*

### Simple subqueries with WHERE

Let's start with the definition of a simple subquery. A simple subquery is a query, nested inside another query, that can be run on its own. The example you see here has a subquery in the WHERE clause

```sql
SELECT home_goal 
FROM match
WHERE home_goal > (
    SELECT AVG(home_goal)
    FROM match);
``` 

**NOTE :** A simple subquery is evaluated once in the entire query. This means that SQL first processes the information inside the subquery, gets the information it needs, and then moves on to processing information in the OUTER query. 

The first type of simple subquery we'll explore is the subquery in the **WHERE** clause. These are useful for filtering results based on information you'd have to calculate separately beforehand. 

Let's generate a list of matches in the 2012/2013 season where the number of home goals scored was higher than overall average. You could calculate the average, and then include that number in the main query...

...or you could put the query directly into the WHERE clause, inside parentheses. 

```sql
SELECT date, hometeam_id, awayteam_id, home_goal, away_goal
FROM match
WHERE season = '2012/2013'
    AND home_goal > (SELECT AVG(home_goal)
                     FROM match);
```

|date      |hometeam_id|awayteam_id|home_goal|away_goal|
| ---------| --------- | --------- | ------- | ------- |
|2012-07-28|9998       |1773       |5        |2        |
|2012-07-29|9987       |9984       |3        |3        |
|2012-10-05|9993       |9991       |2        |2        |

This way, you have one less manual step to perform before getting the results you need.
    
Subqueries are also useful for generating a filtering list. 

```sql
SELECT team_long_name, team_short_name AS abbr
FROM team
WHERE team_api_id IN
      (SELECT hometeam_id
       FROM match 
       WHERE country_id = 15722);
```

This query answers the question, "Which teams are part of Poland's league?" The "team" table doesn't have the country IDs, but the "match" table has both country and team IDs. By querying a list of hometeam_id's from match where the country_id is 15722, which indicates "Poland", you can generate a list to compare to the team_api_id column IN the WHERE clause.

### Subqueries in the FROM statement


You probably noticed that subqueries in WHERE can only return a single column. But what if you want to return a more complex set of results? 

Subqueries in the **FROM** statement are a robust tool for restructuring and transforming your data. Often, the data you need to answer a question is not yet in the format necessary to query it directly, and requires some additional processing to prepare for analysis:

For example, you may want to transform your data into a different shape, or pre-filter it before making calculations. Subqueries in a FROM statement are a common way of preparing that data. Subqueries in FROM are also useful when calculating aggregates of aggregate information. Let's say you're interested in getting the top 3 teams who scored the highest number of home_goals on average in the 2011/2012 season. You would first calculate the average for each team in the league, and THEN calculate the max value for any team overall. This can be easily accomplished with a subquery in FROM.

To summarize, subqueries in the FROM statement are useful for:

- Restructure and transform your data
    - Transforming data from long to wide before selecting
    - Prefiltering data
- Calculating aggregates of aggregates
.
Let's examine the home_goal average for every team in the database. First, you will create the query that will become your subquery. 

```sql
SELECT t.team_long_name as team, AVG(m.home_goal) as home_avg
FROM match AS m
LEFT JOIN team as t
ON m.home_team_id = t.team_api_id
WHERE season = '2011/2012'
GROUP BY team;
```

This query here selects the team's long name from the "team" table, and the AVG of home_goal column from the "match" table. The team table is left joined onto the "match" table using hometeam_id, which will give you the identity of the home team. The query is then filtered by season and grouped by team. The results look like this


|team            |home_avg|
| -------------- | ------ | 
|1. FC Köln      |1.14    |
|1. FC Nuernberg |1.30    |
|1. FSV Mainz 05 |1.44    |
|AC Ajaccio      |1.12    | 

--> an average value calculated for each team in the table.

In order to get only the top team as a final result, place this ENTIRE query without the semicolon inside the FROM statement of an outer query, make sure to give it an alias, then add it to the main query, selecting the team, and home_avg columns from the subquery, just as you would with any other table in the database.
Finally, don't forget to order by home_avg, descending, and limit the query to 3 results. 


```sql
SELECT team_ home_avg
FROM (SELECT 
      t.team_long_name as team, 
      AVG(m.home_goal) as home_avg
    FROM match AS m
    LEFT JOIN team as t
    ON m.home_team_id = t.team_api_id
    WHERE season = '2011/2012'
    GROUP BY team) AS subquery
ORDER BY home_avg DESC
LIMIT 3;
```

|team           |home_avg|
| ------------- | ------ | 
|FC Barcelona   |1.14    |
|Real Madrid FC |1.30    |
|PSV            |1.44    |



The final query returns your top 3 teams based on home_goals scored in the 2011/2012 season. And it seems our top team for that season is Barcelona!


There are a few key things to remember when using subqueries in the FROM statement:

- you have the ability to create more than one subquery in the FROM statement of any main query. When you do so, make sure that you 
    - give each subquery an alias
    - make sure that you are able to JOIN them to each other, just as you would when querying a table from your database.
- you can join a subquery to any existing table in your database. 
    - you need to make sure you have a column in the subquery that you can use with the JOIN you'd like to perform.

### Subqueries in SELECT


So far, we've covered the use of simple subqueries in FROM and WHERE statements. Subqueries can also be included in a **SELECT** statement to bring summary values into a detailed data set.

**Subqueries in SELECT are used to return a single, aggregate value.**

This can be fairly useful, since, as you'll recall, you cannot include an aggregate value in an ungrouped SQL query. Subqueries in SELECT are one way to get around that. Subqieries in SELECT are also useful when performing complex mathematical calculations on information in your data set. For example, you may want to see how much an individual score deviates from an average -- say, how higher than the average is this individual score?

Including a subquery in SELECT is fairly simple, and is set up the same way you set up subqueries in the WHERE and FROM clauses. Let's say we want to create a column to compare the total number of matches played in each season to the total number of matches played OVERALL. We can first calculate the overall count of matches across all seasons, which is 12,837.

We can then add that single number to the SELECT statement, which yields the following results...
...or, we can skip that step, and add the subquery directly to the SELECT statement to get identical results.

Subqueries in SELECT are also incredibly useful for calculations with the data you are querying. The single value returned by a subquery in select can be used to calculate information based on existing information in a database. For example, the overall average number of goals scored in a match across all seasons is 2.72. If you want to calculate the difference from the average in any given match, you can either calculate this number ahead of time in a separate query, and input the value into the SELECT statement...

```sql
SELECT AVG(home_goal + away_goal)
FROM match
WHERE season = '2011/2012'
```
|2.72|

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    (home_goal + away_goal) - 2.72 as diff
FROM match
WHERE season = '2011/2012'
```

...or you can use a subquery that calculates this value for you in your SELECT statement, and subtract it from the total goals in that match. 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    (home_goal + away_goal) - 
    (SELECT AVG(home_goal + away_goal)
    FROM match
    WHERE season = '2011/2012') AS diff
FROM match
WHERE season = '2011/2012'
```

Overall, this second option can save you a lot of time and errors in your work, and the results you see here, are identical to calculating the result manually.

There are a few unique considerations when working with subqueries in SELECT. 

- subquery needs to return a single value. If your subquery result returns multiple rows, your entire query will generate an error. 
- Make sure you have all filters in the right place.

### Subqueries best practice

In SQL, you can include as many simple subqueries as you need within multiple clauses within your query. However, your queries can quickly become long, and difficult to read.

For example, the query you see here includes a subquery in the SELECT, FROM, and WHERE statements. You don't have to read through this now, but it's worth getting a sense of how extensive SQL queries can get, and discuss some best practices for reading, and writing large queries.


<figure>
  <img src="images/Subquery_complex.png" alt="Subquery_complex" style="width:40%">
  <figcaption>Fig. - A complex subquery that is difficult to read.</figcaption>
</figure>


#### Format your queries

The best practice you can start early on in your SQL journey is properly formatting your queries. It's important to properly line up your SELECT, FROM, GROUP BY, and WHERE statements, and all of the information contained in them. This way, you and others you work with can return to a saved query and easily tell if these statements are part of a main query, or a subquery.

```sql
SELECT
    col1,
    col2,
    col3
FROM table1
WHERE col1 = 2;
```

#### Annotate your queries

It's also considered best practice to annotate your queries with comments in order to tell the user what it does -- using either a multiple line comment, inside a forward slash, star, and ending with a star, and a forward slash.

```sql
/* This query filters for col1 = 2
and only selects data from table1 */
SELECT
    col1,
    col2,
    col3
FROM table1
WHERE col1 = 2;
```

You can also use in-line comments using two dashes. Every piece of information after an in-line comment is treated as text, even if it's a recognized SQL command.

```sql
/* This query filters for col1 = 2
and only selects data from table1 */
SELECT
    col1,
    col2,
    col3
FROM table1 -- this table has 10000 rows
WHERE col1 = 2; -- Filter WHERE value 2
```

#### Indent your queries

Make sure that you properly indent all information contained within a subquery. That way, you can easily return to the query and understand what information is being processed first, where you need to apply changes, such as to a range of dates, and what you can expect from your results if you make those changes.

```sql
SELECT
    col1,
    col2,
    col3
FROM table1
WHERE col1 IN
           (SELECT id
            FROM table2
            WHERE year = 1991);
```
Make sure that you clearly indent all information that's part of a single column, such as a long CASE statement, or a complicated subquery in SELECT. 


<figure>
  <img src="images/Subquery_complex_2.png" alt="Subquery_complex_2" style="width:30%">
  <figcaption>Fig. - A complex subquery properly filtered.</figcaption>
</figure>

In order to best keep track of all the conditions necessary to set up each WHEN clause, each THEN clause, and how they create the column outcome, it's important to clearly indent each piece of information in the statement. Overall, I highly recommend you read Holywell's SQL Style Guide to get a sense of all the formatting conventions when working with SQL queries.

#### Is that subquery necessary?

When deciding whether or not you need a subquery, it's important to know that each subquery you add requires additional computing power to generate your results. Depending on the size of your database and the number of records you extract in your query, you may significantly increase the amount of time it takes to run your query. So it's always worth asking whether or not a specific subquery is necessary to get the results you need.

#### Properly filter each subquery!

Finally, when constructing a main query with multiple subquery, make sure that your filters are properly placed in every subquery, and the main query, in order to generate accurate results. 

<figure>
  <img src="images/Subquery_filter.png" alt="Subquery_filter" style="width:40%">
  <figcaption>Fig. - A subquery with multiple filters.</figcaption>
</figure>

The query here, for example, filters for the 2013/2014 season in 3 places -- once in the SELECT subquery, once in the WHERE subquery, and once in the main query. This ensures that all data returned is only about matches from the 2013/2014 season.

## Correlated subqueries

Now that you've covered the basics of simple subqueries, let's learn how to construct correlated subqueries.

Correlated subqueries are a special kind of subquery that use values from the outer query in order to generate the final results. The subquery is re-executed each time a new row in the final data set is returned, in order to properly generate each new piece of information. Correlated subqueries are used for special types of calculations, such as 

- advanced joining, 
- filtering, and 
- evaluating of data in the database.

Let's walk through an example of one of these queries. In the previous chapter, you completed an exercise that answered the question, "Which match stages, where the stakes get higher in each stage, tend to have a higher than average number of goals scored?"
You achieved this using 3 simple subqueries in the SELECT, FROM, and WHERE statements. 

```sql
SELECT 
	-- Select the stage and average goals from s
	s.stage,
	ROUND(s.avg_goals,2) AS avg_goal,
    -- Select the overall average for 2012/2013
	(SELECT AVG(home_goal + away_goal) 
     FROM match 
     WHERE season = '2012/2013') AS overall_avg
FROM 
	-- Select the stage and average goals in 2012/2013 from match
	(SELECT
         stage,
         AVG(home_goal + away_goal) AS avg_goals
     FROM match
     WHERE season = '2012/2013'
     GROUP BY stage) AS s
WHERE 
	-- Filter the main query using the subquery
	s.avg_goals > (SELECT AVG(home_goal + away_goal) 
                   FROM match 
                   WHERE season = '2012/2013');
```

However, the same output can also be produced with a correlated subquery. Let's focus on the subquery in the WHERE statement.

```sql
SELECT 
	-- Select the stage and average goals from s
	s.stage,
	ROUND(s.avg_goals,2) AS avg_goal,
    -- Select the overall average for 2012/2013
	(SELECT AVG(home_goal + away_goal) 
     FROM match 
     WHERE season = '2012/2013') AS overall_avg
FROM 
	-- Select the stage and average goals in 2012/2013 from match
	(SELECT
         stage,
         AVG(home_goal + away_goal) AS avg_goals
     FROM match
     WHERE season = '2012/2013'
     GROUP BY stage) AS s
WHERE s.avg_goals > (SELECT AVG(home_goal + away_goal) 
                   FROM match as m
                   WHERE s.stage > m.stage);
```

This query has only one difference -- instead of including a filter by season, the WHERE clause filters for data where the outer table's match stage, pulled from the subquery in FROM, is HIGHER than the overall average generated in the WHERE subquery. The entire WHERE statement is saying, in essence, "return stages where the values in the subquery are higher than the average."

Here are the results generated by this query. 

|stage|avg_goals|
|-----|---------|
|3    |2.83     |
|4    |2.8      |
|6    |2.78     |
|8    |3.09     |
|10   |2.96     |

This may seem a bit complicated, but with a few more examples and a bit of practice, you will start to get the hang of how useful correlated subqueries can be.

Let's quickly walk through some key differences between simple and correlated subqueries. Simple subqueries can be used in extracting, structuring or filtering information, and can run independent of the main query. In contrast, a correlated subquery cannot be executed on its own because it's dependent on values in the main query. Additionally, a simple subquery is evaluated once in the entire statement. A correlated subquery is evaluated in loops -- once for each row generated by the data set. This means that adding correlated subqueries will slow down your query performance, since your query is recalculating information over and over. Be careful not to include too many correlated subqueries -- or your query may take a long time to run!

Here's another, smaller example of a query in which you can use a correlated subquery. Let's answer the question, "What is the average number of goals scored in each country across all match seasons?" This is an an easy enough question, right? You simply join the match table to the country table on the country's id, and extract the country's name, take an average of the goals scored, and group the entire query by the country's name, yielding one row with an average value per country.

```sql
SELECT 
    c.name AS country
    AVG(m.home_goal + m.away_goal) AS avg_goals
FROM country as c
LEFT JOIN match AS m
ON c.id = m.country_id
GROUP BY country
```

A correlated subquery can be used here in lieu of a join. 

```sql
SELECT 
    c.name AS country
    (SELECT AVG(home_goal + away_goal)
     FROM match AS m
     WHERE m.country_id = c.id) AS avg_goals
FROM country as c
GROU BY country;
```
Take a look at the outer query first. The name of the country is selected from the country table, aliased as "c". The second column selected is a scalar subquery, selecting the average total goals scored across all seasons from the match table. You'll notice that the WHERE clause asks SQL to return values where the inner, match table's country_id column matches the c.id column in the outer query's country table. This way, the entire join is replaced, and the results are identical.

10. Let's practice!
Okay! It's time to practice using correlated subqueries.

## Windowing functions

Let's tackle another limitation you've likely encountered in SQL -- the fact that you have to group results when using aggregate functions. If you try to retrieve additional information without grouping by every single non-aggregate value, your query will return an error. 

```sql
SELECT 
    country_id,
    season,
    date,
    AVG(home_goal) AS avg_home
FROM match
GROUP BY country_id
```

**ERROR: column "match.season" must appear in th GROUP BY clause or be used in an aggregate function**

Thus, you can't compare aggregate values to non-aggregate data.

You can work around this limitation using a **window function**. 
Window functions are a class of functions that perform calculations on a result set that has already been generated, also referred to as a "window". You can use window functions to perform aggregate calculations without having to group your data, just as you did with a subquery in SELECT. You can also use them to calculate information such as running totals, rankings, and moving averages.

So what's a window function? How do you use it? Let's start with a query from chapter 2, where we answered the question, "how many goals were scored in each match in 2011/2012, and how did that compare to the average?" 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    (SELECT AVG(home_goal + away_goal)
         FROM match
         WHERE season = '2011/2012') as overall_avg
FROM match
WHERE season = '2011/2012'
```

This query selects two columns from match table, and then used a subquery in SELECT to pass the overall average along the data set without aggregating the results.

The same results can be generated using the clause common to all window functions -- the **OVER clause**. 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    AVG(home_goal + away_goal) OVER() AS overall_avg
FROM match
WHERE season = '2011/2012'
```

Instead of writing a subquery, calculate the AVG of home_goal and away_goal, and follow it with the OVER clause. This clause tells SQL to "pass this aggregate value over this existing result set." 

|date      |goals|overall_avg|
|----------|-----|-----------|
|2011-07-29|3    |2.72       |
|2011-07-30|2    |2.72       |
|2011-07-30|4    |2.72       |
|2011-07-30|1    |2.72       |

The results are identical to the previous statement that used a subquery in SELECT, with a simpler syntax and faster processing time.


Another simple type of column you can generate with a window function is a **RANK**. A RANK simply creates a column numbering your data set from highest to lowest, or lowest to highest, based on a column that you specify. Let's take the same query as the previous example, without the window function, and use it to answer the question -- what is the RANK of matches based on the number of goals scored?

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
FROM match
WHERE season = '2011/2012'
```

|date      |goals|
|----------|-----|
|2011-07-29|3    |
|2011-07-30|2    |
|2011-07-30|4    |
|2011-07-30|1    |


We can answer this using the RANK window function. In order to set this up, let's add a new column in SELECT as you see here. 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    RANK()OVER(ORDER BY home_goal + away_goal) as goal_ranks
FROM match
WHERE season = '2011/2012'
```

To create the rank, you start with the RANK function, using parentheses, followed by the OVER clause. Inside the OVER clause, include the ORDER BY clause, and the column or columns you want to use to generate the rank. By default, the RANK function orders the results and ranking from smallest to largest values. 

|date      |goals|goals_rank|
|----------|-----|----------|
|2012-04-28|0    |1         |
|2011-12-26|0    |1         |
|2011-09-10|0    |1         |
|2011-08-27|0    |1         |

In the case of our data set here, this isn't particularly informative.

You can easily correct this by adding the DESC function to reverse the order of the rank, just as you would if you were using ORDER BY at the end of your query. 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    RANK()OVER(ORDER BY home_goal + away_goal DESC) as goal_ranks
FROM match
WHERE season = '2011/2012'
```
|date      |goals|goals_rank|
|----------|-----|----------|
|2011-11-06|10   |1         |
|2011-08-28|10   |1         |
|2012-05-12|9    |3         |
|2012-02-12|9    |3         |

You'll notice that the RANK function automatically ties identical values, such as the first 2 results, and then skips the next value in the rank.

There are a few key considerations when using window functions. 
- First, window functions are processed after the entire query except the final ORDER BY statement. Thus, the window function uses the result set to calculate information, as opposed to using the database directly. 
- Second, it's important to know that window functions are available in PostgreSQL, Oracle, MySQL, but not in SQLite.

### OVER and PARTITION BY

The real bread and butter of window functions that differentiates them from subqueries in select, are in the functions you can add within the OVER clause.

One important statement you can add to your OVER clause is PARTITION BY. A partition allows you to calculate separate values for different categories established in a partition. This is one way to calculate different aggregate values within one column of data, and pass them down a data set, instead of having to calculate them in different columns. The syntax for a partition is fairly simple. 

```sql
AVG(home_goal)OVER(PARTITION BY season) 
```
Just like before, use an aggregate function to compute a calculation, such as the AVG of the home_goal column. You then add the OVER clause afterward, and inside the parentheses, state PARTITION BY, followed by the column you want to partition the average by. This will then return the overall average for, or PARTITIONed BY each season.

Let's take a look at how this works in a query. This is the example query from the previous lesson, answering the question, 

*How many goals were scored in each match, and how did that compare to the overall average?* 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    AVG(home_goal + away_goal) OVER() AS overall_avg
FROM match
```

This is accomplished using the OVER clause, and the query returns the date, goals scored, and overall average.

Let's expand on the previous question, and instead ask, 

*How many goals were scored in each match, and how did that compare to the season's average?*

We can do this by adding a PARTITION BY clause to the OVER clause from the previous slide. 

```sql
SELECT 
    date,
    (home_goal + away_goal) AS goals
    AVG(home_goal + away_goal) OVER(PARTITION BY season) AS season_avg
FROM match
```

Specifying, "PARTITION BY season" returns each season's average on each row, in accordance to the season that each record belongs to. 

|date      |goals|season_avg|
|----------|-----|----------|
|2011-12-17|3    |2.717     |
|2012-05-01|2    |2.717     |
|2012-11-27|4    |2.773     |
|2013-04-20|1    |2.773     |
|2013-11-09|5    |2.767     |


As you can see, rows 1 and 2 are matches played in the 2011/2012 season, and the season_avg column contains the 2011/2012 season average. Rows 3 and 4 are part of the 2012/2013 season, and return the 2012/2013 season average.

You can also use PARTITION to calculate values broken out by multiple columns. 

```sql
SELECT 
    c.name,
    m.season,
    (home_goal + away_goal) AS goals,
    AVG(home_goal + away_goal) OVER(PARTITION BY m.season, c.name) AS season_avg
FROM country AS c
LEFT JOIN match AS m
ON c.id = m.country_id
```

In the query you see here, the OVER clause contains two columns to partition the AVG goals scored--season, and country. 

|name       |season   |goals|season_ctry_avg|
|-----------|---------|-----|---------------|
|Belgium    |2011/2012|1    |2.88           |
|Netherlands|2014/2015|1    |3.08           |
|Belgium    |2011/2012|1    |2.88           |
|Spain      |2014/2015|1    |2.66           |

The result set returns the average goals scored broken out by season and country. 
In row 1, a match was played in Belgium in the 2011/2012 season, and had 1 goal scored throughout the match. This is compared to the 2.88, which is the average goals scored in Belgium in the 2011/2012 season.

PARTITION BY is a pretty straight forward addition to the OVER clause. You can partition calculations by 1 or more columns as necessary to answer a question you may have. Additionally, you can use a PARTITION with any kind of window function -- calculation, rank, or others that we will discuss further in the following lesson.

### Sliding window

In addition to calculating aggregate and rank information, window functions can also be used to calculate information that changes with each subsequent row in a data set.

These types of window functions are called **sliding windows**. Sliding windows are functions that perform calculations relative to the current row of a data set. You can use sliding windows to calculate a wide variety of information that aggregates one row at a time down your data set:
- running totals
- sums 
- counts and 
- averages in any order you need. 

A sliding window calculation can also be partitioned by one or more columns, just like a non-sliding window.

A sliding window function contains specific functions within the OVER clause to specify the data you want to use in your calculations. The general syntax looks like this:

```sql
ROWS BETWEEN <start> AND <finish>
```

you use the phrase ROWS BETWEEN to indicate that you plan on slicing information in your window function for each row in the data set, and then you specify the starting and finishing point of the calculation. 
For the start and finish in your ROWS BETWEEN statement, you can specify a number of keywords:

- PRECEDING
- FOLLOWING
- UNBOUNDED PRECEDING
- UNBOUNDED FOLLOWING
- CURRENT ROW

PRECEDING and FOLLOWING are used to specify the number of rows before, or after, the current row that you want to include in a calculation. 
UNBOUNDED PRECEDING and UNBOUNDED FOLLOWING tell SQL that you want to include every row since the beginning, or the end, of the data set in your calculations. 
Finally, CURRENT ROW tells SQL that you want to stop your calculation at the current row.

For example, the sliding window in this query includes several key pieces of information in its calculation. 

```sql
SELECT 
    date,
    home_goal,
    away_goal,
    SUM(home_goal)
        OVER(ORDER BY date ROWS BETWEEN
             UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total
FROM match
WHERE hometeam_id = 8456 AND awayteam_id = 8456
```

It first states that the goal is to calculate a sum of goals scored when Manchester City played as the home team during the 2011/2012 season. It then tells you that you want to turn this calculation into a running total, ordered by the date of the match from oldest to most recent and calculated from the beginning of the data set to the current row. Your resulting data set looks like this, with a column calculating the total number of goals scored across the season, with a final total listed in the last row.

|date      |home_goal|away_goal|running_total|
|----------|---------|---------|-------------|
|2011-08-15|4        |0        |4            |
|2011-09-10|3        |0        |7            |
|2011-09-24|2        |0        |9            |
|2011-10-15|4        |1        |13           |

Using the PRECEDING statement, you also have the ability to calculate sliding windows with a more limited frame. For example, the query you see here is similar to the previous one, with a slightly modified sliding window. 

```sql
SELECT 
    date,
    home_goal,
    away_goal,
    SUM(home_goal)
        OVER(ORDER BY date ROWS BETWEEN
             1 PRECEDING AND CURRENT ROW) AS last2
FROM match
WHERE hometeam_id = 8456 AND awayteam_id = 8456
```

The phrase UNBOUNDED PRECEDING is replaced here with the phrase 1 PRECEDING, which calculates the sum of Manchester City's goals in the current and previous match. 

|date      |home_goal|away_goal|running_total|
|----------|---------|---------|-------------|
|2011-08-15|4        |0        |4            |
|2011-09-10|3        |0        |7            |
|2011-09-24|2        |0        |5            |
|2011-10-15|4        |1        |6           |

As you see in the data set here, the two rows in red are used to calculate the sum on the second row, and the two rows in green are used to calculate the sum on the third row.